pointertoaperson/sensor_ppg/stm32_dsp/src/drivers/uart.c

/**
 * @file    uart.c
 * @brief   UART driver interface for STM32F103 microcontroller series and variants like STM32F103C8T6/CBT6 etc.
 * @author  Umesh Puri
 * @date    2025-06-02
 * @version 1.0
 *
 * This file provides function prototypes for initializing and using the USART
 * peripheral for serial communication on STM32F103 microcontrollers.
 *
 * @license MIT License
 * Copyright (c) 2025 Umesh
 */

#include "stm32f1xx.h"
#include "system_stm32f1xx.h"
#include "uart.h"

#define Perpher_CLK 72000000
#define Baudrate 115200

/*
static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate)
{
	return ((PeriphClk + (BaudRate/2U))/BaudRate);
}
*/

static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate)
{
	uint32_t usartdiv_mult100 = (25 * PeriphClk) / (4 * BaudRate); // 100 * USARTDIV
	uint32_t mantissa = usartdiv_mult100 / 100;
	uint32_t fraction = ((usartdiv_mult100 - (mantissa * 100)) * 16 + 50) / 100;
	return (mantissa << 4) | (fraction & 0x0F);
}

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate)
{
	USARTx->BRR = compute_uart_bd(PeriphClk, BaudRate);
}

void uart1_write(int ch)
{
	/*Make sure the transmit data register is empty*/
	while (!(USART1->SR & USART_SR_TXE))
	{
	}

	/*Write to transmit data register*/
	USART1->DR = (ch & 0xFF);
}

char uart1_read(void)
{

	while (!(USART1->SR & USART_SR_RXNE))
	{
	}
	return USART1->DR;
}

int uart1_init(void)
{

	/*UART1 Pin configures*/

	// enable clock access to GPIOA
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
	// Enable clock access to alternate function
	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;

	/*Confgiure PA9 as output maximum speed to 50MHz
	 * and alternate output push-pull mode*/
	GPIOA->CRH |= GPIO_CRH_MODE9;

	GPIOA->CRH |= GPIO_CRH_CNF9_1;
	GPIOA->CRH &= ~GPIO_CRH_CNF9_0;

	// configure PA10 for input

	GPIOA->CRH &= ~(GPIO_CRH_MODE10);

	GPIOA->CRH |= GPIO_CRH_CNF10_0;
	GPIOA->CRH &= ~GPIO_CRH_CNF10_1;

	/*Don't remap the pins*/
	AFIO->MAPR &= ~AFIO_MAPR_USART1_REMAP;

	// enable clock access to USART1

	RCC->APB2ENR |= RCC_APB2ENR_USART1EN;

	// Transmit Enable
	USART1->CR1 |= USART_CR1_TE;
	// Enable reciever
	USART1->CR1 |= USART_CR1_RE;
	/*Set baudrate */
	uart_set_baudrate(USART1, Perpher_CLK, Baudrate);
	// Enable UART
	USART1->CR1 |= USART_CR1_UE;
	return 0;
}
